-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: 1.221.22.173    Database: school
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `attendance`
--

DROP TABLE IF EXISTS `attendance`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `attendance` (
  `id` int NOT NULL AUTO_INCREMENT,
  `dep` varchar(45) DEFAULT '이젠컴퓨터학과',
  `scid` int DEFAULT NULL,
  `stNum` varchar(45) DEFAULT NULL,
  `stName` varchar(45) DEFAULT NULL,
  `stPhoneNum` varchar(45) DEFAULT NULL,
  `stAddr1` varchar(45) DEFAULT NULL,
  `stAddr2` varchar(45) DEFAULT NULL,
  `att` int DEFAULT '0',
  `abs` int DEFAULT '0',
  `late` int DEFAULT '0',
  `ets` int DEFAULT '0',
  `time` date DEFAULT (curdate()),
  `status` varchar(45) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=66 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `attendance`
--

LOCK TABLES `attendance` WRITE;
/*!40000 ALTER TABLE `attendance` DISABLE KEYS */;
INSERT INTO `attendance` VALUES (8,'이젠컴퓨터학과',1,'23122601','학생1','010-0000-0001','경기 성남시 분당구 백현동 582-7','어딘가1',2,0,0,0,'2024-04-24',''),(9,'이젠컴퓨터학과',2,'23122601','학생1','010-0000-0001','경기 성남시 분당구 백현동 582-7','어딘가1',0,0,0,0,'2024-04-24',''),(10,'이젠컴퓨터학과',3,'23122601','학생1','010-0000-0001','경기 성남시 분당구 백현동 582-7','어딘가1',0,0,0,0,'2024-04-24',''),(12,'이젠컴퓨터학과',4,'23122601','학생1','010-0000-0001','경기 성남시 분당구 백현동 582-7','어딘가1',0,0,0,0,'2024-04-24',''),(13,'이젠컴퓨터학과',1,'23122603','학생3','010-0000-0003','경기 성남시 분당구 정자동 117','어딘가3',1,0,1,0,'2024-04-24',''),(14,'이젠컴퓨터학과',3,'23122603','학생3','010-0000-0003','경기 성남시 분당구 정자동 117','어딘가3',0,0,0,0,'2024-04-24',''),(15,'이젠컴퓨터학과',1,'23122604','학생4','010-0000-0004','인천 연수구 연수동 578-4','어딘가4',1,0,0,1,'2024-04-24',''),(16,'이젠컴퓨터학과',2,'23122604','학생4','010-0000-0004','인천 연수구 연수동 578-4','어딘가4',0,0,0,0,'2024-04-24',''),(17,'이젠컴퓨터학과',1,'23122605','학생5','010-0000-0005','서울 강남구 신사동 537-5','어딘가5',2,0,0,0,'2024-04-24',''),(18,'이젠컴퓨터학과',4,'23122605','학생5','010-0000-0005','서울 강남구 신사동 537-5','어딘가5',0,0,0,0,'2024-04-24',''),(20,'이젠컴퓨터학과',1,'23122602','학생2','010-0000-0002','제주특별자치도 제주시 영평동 2009-7','어딘가2',1,1,0,0,'2024-04-24',''),(46,'이젠컴퓨터학과',1,'23122601','학생1','010-0000-0001','경기 성남시 분당구 백현동 582-7','어딘가1',1,0,0,0,'2024-04-23','출석'),(47,'이젠컴퓨터학과',1,'23122602','학생2','010-0000-0002','제주특별자치도 제주시 영평동 2009-7','어딘가2',0,1,0,0,'2024-04-23','결석'),(48,'이젠컴퓨터학과',1,'23122603','학생3','010-0000-0003','경기 성남시 분당구 정자동 117','어딘가3',0,0,1,0,'2024-04-23','지각'),(49,'이젠컴퓨터학과',1,'23122604','학생4','010-0000-0004','인천 연수구 연수동 578-4','어딘가4',0,0,0,1,'2024-04-23','기타'),(50,'이젠컴퓨터학과',1,'23122605','학생5','010-0000-0005','서울 강남구 신사동 537-5','어딘가5',1,0,0,0,'2024-04-23','출석'),(51,'이젠컴퓨터학과',1,'23122601','학생1','010-0000-0001','경기 성남시 분당구 백현동 582-7','어딘가1',1,0,0,0,'2024-04-22','출석'),(52,'이젠컴퓨터학과',1,'23122601','학생1','010-0000-0001','경기 성남시 분당구 백현동 582-7','어딘가1',1,0,0,0,'2024-04-22','출석'),(54,'이젠컴퓨터학과',1,'23122602','학생2','010-0000-0002','제주특별자치도 제주시 영평동 2009-7','어딘가2',1,0,0,0,'2024-04-22','출석'),(55,'이젠컴퓨터학과',1,'23122602','학생2','010-0000-0002','제주특별자치도 제주시 영평동 2009-7','어딘가2',1,0,0,0,'2024-04-22','출석'),(57,'이젠컴퓨터학과',1,'23122603','학생3','010-0000-0003','경기 성남시 분당구 정자동 117','어딘가3',1,0,0,0,'2024-04-22','출석'),(58,'이젠컴퓨터학과',1,'23122603','학생3','010-0000-0003','경기 성남시 분당구 정자동 117','어딘가3',1,0,0,0,'2024-04-22','출석'),(60,'이젠컴퓨터학과',1,'23122604','학생4','010-0000-0004','인천 연수구 연수동 578-4','어딘가4',1,0,0,0,'2024-04-22','출석'),(61,'이젠컴퓨터학과',1,'23122604','학생4','010-0000-0004','인천 연수구 연수동 578-4','어딘가4',1,0,0,0,'2024-04-22','출석'),(63,'이젠컴퓨터학과',1,'23122605','학생5','010-0000-0005','서울 강남구 신사동 537-5','어딘가5',1,0,0,0,'2024-04-22','출석'),(64,'이젠컴퓨터학과',1,'23122605','학생5','010-0000-0005','서울 강남구 신사동 537-5','어딘가5',1,0,0,0,'2024-04-22','출석');
/*!40000 ALTER TABLE `attendance` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-24 18:13:37
